blog/app/controllers/articles_controller.rb

def create
  @article = Article.new(article_params)

  if @article.save
---
INSERT INTO "articles" ("created_at", "text", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-04-20 00:13:15.726133"], ["text", "new blog!"], ["title", "BLOG"], ["updated_at", "2014-04-20 00:13:15.726133"]]

def update
  @article = Article.find(params[:id])
---
SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = ? LIMIT 1  [["id", 9]]