blog/app/controllers/comments_controller.rb

  def create
    @article = Article.find(params[:article_id])
    @comment = @article.comments.create(comment_params)
---
SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = ? LIMIT 1  [["id", 10]]
INSERT INTO "comments" ("article_id", "body", "commenter", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["article_id", 10], ["body", "this is a comment"], ["commenter", "hiiiiiii"], ["created_at", "2014-04-20 02:43:27.604818"], ["updated_at", "2014-04-20 02:43:27.604818"]]